# В олимпиаде участвовало N человек. Каждый получил
# определенное количество баллов, при этом оказалось,
# что у всех участников разное число баллов.
# Упорядочите список участников олимпиады в порядке
# убывания набранных баллов. Формат ввода Программа
# получает на вход число участников олимпиады N.
# Далее идет N строк, в каждой строке записана фамилия
# участника, затем, через пробел, набранное им
# количество баллов. Формат вывода Выведите список
# участников (только фамилии) в порядке убывания
# набранных баллов.


n = int(input())
b = []
for pos in range(n):
    pos = [a for a in input().split()]
    b.append((pos[0], int(pos[1])))
b.sort(key=lambda c: c[1])
n = n - 1
while n >= 0:
    print(b[n][0])
    n -= 1
