# Возводить в степень можно гораздо быстрее,
# чем за n умножений! Для этого нужно
# воспользоваться следующими рекуррентными
# соотношениями: aⁿ = (a²)ⁿ/² при четном n,
# aⁿ=a⋅aⁿ⁻¹ при нечетном n. Реализуйте
# алгоритм быстрого возведения в степень.
# Если вы все сделаете правильно,то сложность
# вашего алгоритма будет O(logn). Формат ввода
# Вводится действительное число a и целое
# неотрицательное число n.


def f_power(a, n):
    if n == 0:
        return (1)
    if n % 2 == 1:
        return a * f_power(a, n - 1)
    else:
        return f_power(a * a, (n / 2))


a = float(input())
n = int(input())
print(f_power(a, n))
