# Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых
# неотрицательных чисел. Из всех
# арифметических операций допускаются
# только +1 и -1. Также нельзя использовать
# циклы. Формат ввода Вводятся два
# удовлетворяющих условию задачи числа.
# Числа не превышают 900.


def sum(a, b):
    if b == 0:
        return (a)
    return (1 + sum(a, b - 1))


n, c = int(input()), int(input())
print(sum(n, c))
