# Дан список чисел. Выведите все элементы списка,
# которые больше предыдущего элемента.


n = list(input().split())
i = 1
while i <= len(n) - 1:
    if int(n[i]) > int(n[i - 1]):
        print(n[i], end=' ')
    i += 1
