# Выведите все элементы списка с четными индексами
# (то есть A[0], A[2], A[4], ...). Программа должна
# быть эффективной и не выполнять лишних действий!


n = list(input().split())
i = 0
while i <= len(n) - 1:
    if i == 0 or i % 2 == 0:
        print(n[i], end=' ')
    i += 1
