# Найдите наибольшее значение в списке и
# индекс последнего элемента, который имеет
# данное значение за один проход по списку,
# не модифицируя этот список и не используя
# дополнительного списка.


n = list(input().split())
i, k, t = 0, 0, 0
while i <= len(n) - 1:
    if int(n[i]) >= int(k):
        k, t = n[i], i
    i += 1
print(k, t)
